docs/posts/2025-02-12-duplicate-org-beamer-title-slides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Feb 12, 2025 05:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Duplicate Org Beamer Title Slides</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Duplicate Org Beamer Title Slides
<br />
<span class="subtitle">Feb 12, 2025 04:08</span>
</h1>
<p>
I recently noticed two problems with my LaTeX Beamer lecture slides that I create using Org mode. First, I suddenly had duplicate title slides. My template began with this:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-3">*** </span>
<span class="org-org-latex-and-related">\maketitle</span>
</pre>
</div>

<p>
Deleting that fixed the problem. I guess it just automatically inserts a title slide now. Second, my section and subsection slides weren&rsquo;t being created. Looking at the <code>*.tex</code> file showed that the sections were using the <code>section*</code> variant. Telling the org file to number the sections fixed the problem. Here&rsquo;s the line to use:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+OPTIONS: num:t</span>
</pre>
</div>

<p>
Modifying my <a href="https://github.com/rlridenour/beamer-themes">Beamer theme</a> also fixed the problem. Evidently, it&rsquo;s pretty simple to specify what should be done with the starred sections in this way:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span class="org-font-latex-sedate">\AtBeginSection</span>[&lt;text for starred sections&gt;]{&lt;text for unstarred sections}
</pre>
</div>


<div class="tagline" id="orge9a16ea">
<p>
Tagged:  <a href="../tags/org.html">Org</a> <a href="../tags/LaTeX.html">LaTeX</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Feb 12, 2025 05:49.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
